-- 部门表
CREATE TABLE depart
(
  id   INT PRIMARY KEY AUTO_INCREMENT,  
  `name` VARCHAR(20) NOT NULL
);
-- 员工表
CREATE TABLE employee
(
  id   INT PRIMARY KEY AUTO_INCREMENT,
  `name`      VARCHAR(20),
  sex     CHAR(1) DEFAULT '男',
  salary   DOUBLE,  -- 工资
  birthday  DATE,  -- 生日
  depart_id INT,
  FOREIGN KEY (depart_id) REFERENCES depart(id)
);
-- 插入部门
INSERT INTO depart (`name`) VALUES ('公关部'),('生产部'), ('质检部'), ('财务部'),('市场部'),('销售部'),('研发部'),('行政部');
SELECT * FROM depart;
-- 插入员工
INSERT INTO EMPLOYEE (`name`, sex, salary, birthday, depart_id) VALUES 
('陈向' , '男', 3500, '1993-11-23', 2),
('唐僧' , '男', 4000, '1995-02-10',5),
('孙悟空' , '男', 2000, '1985-10-4',4),
('陈康和' ,'女', 7000, '1997-05-10',3),
('陈康羲' ,'女', 6888, '1999-09-04',7),
('貂蝉' ,'女', 12000, '1988-04-24',1),
('刻晴' ,'女', 6000, '1987-10-3',8),
('迪卢克' ,'男', 2700, '2000-11-12',3),
('沙和尚' ,'男', 3600, '1994-05-20', 2),
('妲己' ,'女', 10000, '1976-04-24',1),
('虞姬' ,'女', 6600, '1995-11-3',8),
('凯亚' ,'男', 4600, '2001-11-12',3),
('杨戬' ,'男', 7800, '1997-08-20', 2),
('甘雨','男',9000,'1990-05-08',6),
('阿贝多' ,'男', 16000, '1998-04-24',1),
('刘语芯' ,'女', 6700, '1997-07-3',8),
('张美美' ,'女', 8700, '2002-10-12',3),
('观音菩萨' ,'女', 9600, '1996-12-20', 2),
('钟美美','女',8000,'1982-10-25',3),
('后羿','男',35000,'1993-11-11',2),
('芭芭拉','女',4500,'1983-06-23',5),
('猪八戒','男',3333,'2000-09-29',2),
('王昭君','女',15000,'1998-11-12',4);
-- 查询所有员工
SELECT * FROM employee;
